glycerin/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    // 1) The water pool at the bottom
    boxToCell
    {
        // Pool occupies the bottom region of the domain
        box (0 0 0) (4 1 0.1);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }

    // 2) A rectangular water droplet above the pool
    boxToCell
    {
        // Adjust the droplet location and dimensions
        box (1.9 2.9 0.0) (2.1 3 0.1);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
);

// ************************************************************************* //
